<?php

// Heading
$_['heading_title']    				= 'Перекладач товарів Deepl API';

$_['text_module']      				= 'Модулі';
$_['text_success']     				= 'Налаштування змінені';
$_['text_edit']        				= 'Редагування';
$_['text_translate_empty']			= 'Не вдалося отримати переклад...';
$_['text_other_language']			= 'Інші мови';
$_['text_success_translate']		= 'Переклад успішно виконано!';
$_['text_quality_optimized']		= 'Найвища якість (повільніше)';
$_['text_prefer_quality_optimized']	= 'Найкраща комбінація якості та швидкості';
$_['text_latency_optimized']		= 'Найшвидша модель';

// Entry
$_['entry_status']     				= 'Статус';
$_['entry_api_key']     			= 'Ключ Api';
$_['entry_save_formatting']     	= 'Зберегти форматування';
$_['entry_model_type']     			= 'Модель перекладу';

//Button
$_['button_translate']     			= 'Перекласти';

//Help
$_['help_model_1']           		= '<p><b>Найвища якість (повільніше):</b> Забезпечує найвищу якість перекладу. Цей режим ідеально підходить для випадків, коли точність перекладу є пріоритетом, наприклад, для офіційних документів або творчих текстів. Не працює в безкоштовному режимі</p>';
$_['help_model_2']           		= '<p><b>Найшвидша модель:</b> Орієнтована на швидкість. Цей режим забезпечує швидкий переклад, але якість може бути трохи нижчою порівняно з "Найвищою якістю (повільніше)". Він ідеально підходить для додатків, де швидкість відгуку є критично важливою, наприклад, для чатів або голосових помічників.</p>';
$_['help_model_3']           		= '<p><b>Найкраща комбінація якості та швидкості:</b> Комбінація якості та швидкості. Цей режим намагається забезпечити високу якість перекладу, одночасно мінімізуючи час очікування. Він є хорошим вибором для більшості випадків використання.</p>';

// Error
$_['error_permission'] 				= 'У вас недостатньо прав для внесення змін';
$_['error_api_key_access'] 			= 'Перевірте правильність вводу ключа Api або його активність! Не вдалося отримати дані...';
$_['error_api_key'] 				= 'Перевірте ключ Api!';
$_['error_select_data'] 			= 'Дані для перекладу не знайдено!';
$_['error_api_data'] 				= 'Виникла помилка: %s';