<?php

// Заголовок
$_['heading_title']    				= 'Переводчик товаров Deepl API';

$_['text_module']      				= 'Модули';
$_['text_success']     				= 'Настройки изменены';
$_['text_edit']        				= 'Редактирование';
$_['text_translate_empty']			= 'Не удалось получить перевод...';
$_['text_other_language']			= 'Другие языки';
$_['text_success_translate']		= 'Перевод выполнен успешно!';
$_['text_quality_optimized']		= 'Высочайшее качество (медленнее)';
$_['text_prefer_quality_optimized']	= 'Оптимальное сочетание качества и скорости';
$_['text_latency_optimized']		= 'Самая быстрая модель';

// Поля ввода
$_['entry_status']     				= 'Статус';
$_['entry_api_key']     			= 'Ключ API';
$_['entry_save_formatting']     	= 'Сохранить форматирование';
$_['entry_model_type']     			= 'Модель перевода';

// Кнопка
$_['button_translate']     			= 'Перевести';

// Справка
$_['help_model_1']           		= '<p><b>Высочайшее качество (медленнее):</b> Обеспечивает наивысшее качество перевода. Этот режим идеально подходит для случаев, когда важна точность перевода, например, для официальных документов или творческих текстов. Не работает в бесплатном режиме.</p>';
$_['help_model_2']           		= '<p><b>Самая быстрая модель:</b> Ориентирована на скорость. Этот режим обеспечивает быстрый перевод, но качество может быть немного ниже по сравнению с "Высочайшим качеством (медленнее)". Идеально подходит для приложений, где важна скорость ответа, например, для чатов или голосовых помощников.</p>';
$_['help_model_3']           		= '<p><b>Оптимальное сочетание качества и скорости:</b> Комбинация качества и скорости. Этот режим стремится обеспечить высокое качество перевода, одновременно минимизируя время ожидания. Это хороший выбор для большинства случаев использования.</p>';

// Ошибки
$_['error_permission'] 				= 'У вас недостаточно прав для внесения изменений';
$_['error_api_key_access'] 			= 'Проверьте правильность ввода ключа API или его активность! Не удалось получить данные...';
$_['error_api_key'] 				= 'Проверьте ключ API!';
$_['error_select_data'] 			= 'Данные для перевода не найдены!';
$_['error_api_data'] 				= 'Произошла ошибка: %s';
